## REST response messages

# Errors
rest.error.during.treatment=Une erreur s'est produite pendant le traitement.
rest.error.pagination.start=La pagination doit commencer \u00e0 l'index 1.
rest.error.pagination.end=La num\u00e9ro de page ne doit pas \u00eatre sup\u00e9rieur au nombre total de pages.
rest.error.no.identity.found=Aucune identit\u00e9 trouv\u00e9e.
rest.error.no.service.contract.found=Aucun contrat de service trouv\u00e9.
rest.error.days.numeric.format=Vous devez indiquer le param\u00e8tre 'days' au format num\u00e9rique.
rest.error.client.already.exists=Un client existe d\u00e9j\u00e0 avec le code fourni.
rest.error.no.client.found=Aucun client n'a pu \u00eatre trouv\u00e9 avec le code fourni.
rest.error.no.client.found.with.token=Aucun client n'a pu \u00eatre trouv\u00e9 avec le token fourni.
rest.error.fail.attribute.validation=Certaines valeurs d'attributs ne passent pas la validation. Veuillez trouver le d\u00e9tail dans la liste des status des attributs.
rest.error.service.contract.violation=La requ\u00eate n'est pas conforme \u00e0 la d\u00e9finition du contrat de service.
rest.error.search.unauthorized=L'application cliente n'est pas autoris\u00e9e \u00e0 rechercher des identit\u00e9s.
rest.error.merge.unauthorized=L'application cliente n'est pas autoris\u00e9e \u00e0 rapprocher des identit\u00e9s.
rest.error.import.unauthorized=L'application cliente n'est pas autoris\u00e9e \u00e0 importer des identit\u00e9s.
rest.error.create.unauthorized=L'application cliente n'est pas autoris\u00e9e \u00e0 cr\u00e9er des identit\u00e9s.
rest.error.update.unauthorized=L'application cliente n'est pas autoris\u00e9e \u00e0 mettre \u00e0 jour des identit\u00e9s.
rest.error.delete.unauthorized=L'application cliente n'est pas autoris\u00e9e \u00e0 demander la suppression d'une identit\u00e9.
rest.error.no.potential.duplicate.found=Aucun doublon potentiel trouv\u00e9.
rest.error.missing.mandatory.attributes=Tous les attributs obligatoires doivent \u00eatre renseign\u00e9s.
rest.error.no.matching.identity=Aucune identit\u00e9 correspondante n'a \u00e9t\u00e9 trouv\u00e9e.
rest.error.update.conflict=Cette identit\u00e9 a \u00e9t\u00e9 mise \u00e0 jour r\u00e9cemment, merci de charger les derni\u00e8res donn\u00e9es avant de mettre \u00e0 jour.
rest.error.forbidden.update.on.merged.identity=Impossible de mettre \u00e0 jour une id\u00e9ntit\u00e9 rapproch\u00e9e. Le customerId de l'identit\u00e9 maîtresse est indiqu\u00e9 dans la r\u00e9ponse.
rest.error.forbidden.update.on.deleted.identity=Impossible de mettre \u00e0 jour une identit\u00e9 supprim\u00e9e.
rest.error.forbidden.mon.paris.active.update=L'application cliente n'est pas autoris\u00e9e \u00e0 mettre \u00e0 jour le marqueur 'mon_paris_active'.
rest.error.conflict.connection.id=Une identit\u00e9 existe d\u00e9j\u00e0 avec le connectionId renseign\u00e9. Le customerId de cette identit\u00e9 est indiqu\u00e9 dans la r\u00e9ponse.
rest.error.primary.identity.not.found=L'identit\u00e9 principale n'a pas pu \u00eatre trouv\u00e9e avec le customerId fourni.
rest.error.primary.identity.deleted=L'identit\u00e9 principale trouv\u00e9e avec le customerId fourni est supprim\u00e9e.
rest.error.primary.identity.merged=L'identit\u00e9 principale trouv\u00e9e avec le customerId fourni est rapproch\u00e9e.
rest.error.primary.identity.update.conflict=L'identit\u00e9 principale a \u00e9t\u00e9 mise \u00e0 jour r\u00e9cemment, merci de charger les derni\u00e8res donn\u00e9es.
rest.error.secondary.identity.not.found=L'identit\u00e9 secondaire n'a pas pu \u00eatre trouv\u00e9e avec le customerId fourni.
rest.error.secondary.identity.deleted=L'identit\u00e9 secondaire trouv\u00e9e avec le customerId fourni est supprim\u00e9e.
rest.error.secondary.identity.merged=L'identit\u00e9 secondaire trouv\u00e9e avec le customerId fourni est rapproch\u00e9e.
rest.error.secondary.identity.update.conflict=L'identit\u00e9 secondaire a \u00e9t\u00e9 mise \u00e0 jour r\u00e9cemment, merci de charger les derni\u00e8res donn\u00e9es.
rest.error.secondary.identity.not.merged=L'identit\u00e9 secondaire trouv\u00e9e avec le customerId fourni n'est pas rapproch\u00e9e.
rest.error.identities.not.merged.together=L'identit\u00e9 secondaire trouv\u00e9e avec le customerId secondaire fourni n'est pas rapproch\u00e9e avec l'identit\u00e9 principale trouv\u00e9e avec le customerId principal fourni.
rest.error.identity.not.found=Aucune identit\u00e9 n'a pu \u00eatre trouv\u00e9e avec le customerId fourni.
rest.error.identity.already.deleted=L'identit\u00e9 est d\u00e9j\u00e0 dans l'\u00e9tat supprim\u00e9.
rest.error.forbidden.delete.on.merged.identity=Une identit\u00e9 rapproch\u00e9e ne peut pas \u00eatre supprim\u00e9e.
rest.error.application.not.found=Aucune application n'a pu \u00eatre trouv\u00e9e avec le code fourni.
rest.error.service.contract.not.found=Aucun contrat de service n'a pu \u00eatre trouv\u00e9 avec le code fourni.
rest.error.unauthorized.operation=Op\u00e9ration non autoris\u00e9e.
rest.error.no.history.found=Aucun historique n'a \u00e9t\u00e9 trouv\u00e9 pour l'identit\u00e9 fournie.
rest.error.no.duplicate.rule.found=Aucune r\u00e8gle de d\u00e9tection de doublon n'a \u00e9t\u00e9 trouv\u00e9e.
rest.error.no.certification.level.found=Aucun niveau de certification n'a \u00e9t\u00e9 trouv\u00e9.
rest.error.no.attribute.key.found=Aucune cl\u00e9 d'attribut n'a \u00e9t\u00e9e trouv\u00e9e.
rest.error.no.certification.processus.found=Aucun processus de certification n'a \u00e9t\u00e9 trouv\u00e9.
rest.error.no.updated.identity.found=Aucune identit\u00e9 mise \u00e0 jour n'a \u00e9t\u00e9 trouv\u00e9e.
rest.error.already.excluded=Les identit\u00e9s ont d\u00e9j\u00e0 \u00e9t\u00e9 exclues des suspicions de doublon.
rest.error.not.excluded=Les identit\u00e9s ne sont pas exlues des suspicious de doublon.
rest.error.identity.already.suspicious=Cette identit\u00e9 a d\u00e9j\u00e0 \u00e9t\u00e9 signal\u00e9e comme suspecte.
rest.error.no.suspicious.identity.found=Aucune identit\u00e9 suspecte n'a \u00e9t\u00e9 trouv\u00e9e.
rest.error.must.provide.client.code.or.token=Vous devez indiquer un client_code ou un client_token.
rest.error.connected.identity.forbidden.update.non.pivot=L'identit\u00e9 est connect\u00e9e, la mise \u00e0 jour des attributs non 'pivot' n'est pas autoris\u00e9e.
rest.error.connected.identity.forbidden.pivot.self.declare=L'identit\u00e9 est connect\u00e9e, l'ajout d'attributs 'pivot' avec un niveau de certification auto-d\u00e9claratif n'est pas autoris\u00e9.
rest.error.connected.identity.forbidden.update.pivot.lesser.certification=L'identit\u00e9 est connect\u00e9e, la mise \u00e0 jour des attributs 'pivot' avec un niveau de certification inf\u00e9rieur n'est pas autoris\u00e9e.
rest.error.connected.identity.forbidden.pivot.certification.under.threshold=L'identit\u00e9 est connect\u00e9e, et au moins un attribut 'pivot' est, ou a \u00e9t\u00e9 demand\u00e9 d'\u00eatre, certifi\u00e9 au dessus du seuil d\u00e9fini. Dans ce cas, tous les attributs 'pivot' doivent \u00eatre renseign\u00e9s, et certifi\u00e9s avec un niveau supp\u00e9rieur ou \u00e9gal au seuil d\u00e9fini.
rest.error.identity.all.pivot.attribute.same.certification=Tous les attributs 'pivot' doivent \u00eatre renseign\u00e9s et certifi\u00e9s avec le m\u00eame processus de certification.

# Info
rest.info.potential.duplicate.found=Potentiel(s) doublon(s) trouv\u00e9(s).
rest.info.successful.operation=Op\u00e9ration r\u00e9alis\u00e9e avec succ\u00e8s.
rest.info.no.attribute.change=Aucun attribut n'a \u00e9t\u00e9 mis \u00e0 jour car aucune modification n'\u00e9tait applicable.

#####################
## Attribute statuses
#####################

attribute.status.not.created=Cet attribut n'a pas \u00e9t\u00e9 cr\u00e9\u00e9 car la valeur fournie est invalide.
attribute.status.created=Cet attribut a \u00e9t\u00e9 correctement cr\u00e9\u00e9.
attribute.status.not.updated=Cet attribut existe d\u00e9j\u00e0 avec la m\u00eame valeur et le m\u00eame certificat.
attribute.status.updated=Cet attribut a \u00e9t\u00e9 correctement mis \u00e0 jour.
attribute.status.not.removed=Cet attribut est obligatoire et ne peut pas \u00eatre supprim\u00e9.
attribute.status.removed=Cet attribut a \u00e9t\u00e9 correctement supprim\u00e9.
attribute.status.uncertified=Cet attribut a \u00e9t\u00e9 correctement d\u00e9certifi\u00e9.
attribute.status.formatted.value=La valeur de cet attribut a \u00e9t\u00e9 formatt\u00e9e avant traitement.
attribute.status.insufficient.certification.level=Cet attribut ne peut pas \u00eatre mis \u00e0 jour car le certificat existant est d'un niveau supp\u00e9rieur \u00e0 celui du certificat fourni dans la requ\u00eate.

# Attribute validation

attribute.status.validation.error.only.alphanum.apostrophe.space.dash=Valeur invalide. Seuls les carract\u00e8res alphanum\u00e9riques, apostrophe, espace et tiret sont autoris\u00e9s.
attribute.status.validation.error.only.alpha.apostrophe.space.dash=Valeur invalide. Seuls les carract\u00e8res alphas, apostrophe, espace et tiret sont autoris\u00e9s.
attribute.status.validation.error.date.format=Valeur invalide. Les dates doivent \u00eatre \u00e9crites sur 10 carract\u00e8res, au format 'jj/mm/aaaa'.
attribute.status.validation.error.mobile.phone.format=Valeur invalide. Seuls les carract\u00e8res num\u00e9riques sont autoris\u00e9s. Cela doit repr\u00e9senter un num\u00e9ro français sur 10 chiffres, d\u00e9butant par O6 ou 07.
attribute.status.validation.error.fixed.phone.format=Valeur invalide. Invalid value. Seuls les carract\u00e8res num\u00e9riques sont autoris\u00e9s. Cela doit repr\u00e9senter un num\u00e9ro français sur 10 chiffres, d\u00e9butant par 01 \u00e0 05, ou 09.
attribute.status.validation.error.email.format=Valeur invalide. L'email doit \u00eatre \u00e9crit suivant le format 'xxx@yyy.zzz'.
attribute.status.validation.error.geocodes.format=Valeur invalide. Seuls les carract\u00e8res alphanum\u00e9riques sont autoris\u00e9s. Le code doit exister dans le r\u00e9f\u00e9rentiel Geocodes.
attribute.status.validation.error.only.uppercase.space=Valeur invalide. Seuls les carract\u00e8res alphas en majuscules non accentu\u00e9s et espace sont autoris\u00e9s.
attribute.status.validation.error.gender.format=Valeur invalide. Seuls les carract\u00e8res 0, 1 ou 2 sont autoris\u00e9s.

# Geocode validation

attribute.status.validation.error.unknown.geocodes.code=Le code fourni est inconnu du r\u00e9f\u00e9rentiel Geocodes.
attribute.status.validation.error.unknown.geocodes.label=Le label fourni est inconnu du r\u00e9f\u00e9rentiel Geocodes.
attribute.status.validation.error.geocodes.label.multiple.results=Le label fourni correspond \u00e0 plusieurs r\u00e9sultats dans le r\u00e9f\u00e9rentiel Geocodes. Merci de pr\u00e9ciser en fournissant le code.
attribute.status.geocodes.label.overridden=Le label fourni ne correspond pas au code fourni, et a \u00e9t\u00e9 remplac\u00e9 par le label Geocodes correct.
