## REST response messages

# Errors
rest.error.during.treatment=Une erreur s'est produite pendant le traitement.
rest.error.api.communication=Erreur de communication avec l'API.
rest.error.pagination.start=La pagination doit commencer \u00e0 l'index 1.
rest.error.page.size=La taille d\u00e9sir\u00e9e des pages doit \u00eatre d'au moins 1.
rest.error.pagination.end=La num\u00e9ro de page ne doit pas \u00eatre sup\u00e9rieur au nombre total de pages.
rest.error.no.identity.found=Aucune identit\u00e9 trouv\u00e9e.
rest.error.identity.deleted=Cette identit\u00e9 a \u00e9t\u00e9 supprim\u00e9e.
rest.error.no.service.contract.found=Aucun contrat de service trouv\u00e9.
rest.error.days.numeric.format=Vous devez indiquer le param\u00e8tre 'days' au format num\u00e9rique.
rest.error.client.already.exists=Un client existe d\u00e9j\u00e0 avec le code fourni.
rest.error.no.client.found=Aucun client n'a pu \u00eatre trouv\u00e9 avec le code fourni.
rest.error.no.client.found.with.token=Aucun client n'a pu \u00eatre trouv\u00e9 avec le token fourni.
rest.error.fail.attribute.validation=Certaines valeurs d'attributs ne passent pas la validation. Veuillez trouver le d\u00e9tail dans la liste des status des attributs.
rest.error.service.contract.violation=La requ\u00eate n'est pas conforme \u00e0 la d\u00e9finition du contrat de service.
rest.error.search.unauthorized=L'application cliente n'est pas autoris\u00e9e \u00e0 rechercher des identit\u00e9s.
rest.error.merge.unauthorized=L'application cliente n'est pas autoris\u00e9e \u00e0 rapprocher des identit\u00e9s.
rest.error.import.unauthorized=L'application cliente n'est pas autoris\u00e9e \u00e0 importer des identit\u00e9s.
rest.error.create.unauthorized=L'application cliente n'est pas autoris\u00e9e \u00e0 cr\u00e9er des identit\u00e9s.
rest.error.update.unauthorized=L'application cliente n'est pas autoris\u00e9e \u00e0 mettre \u00e0 jour des identit\u00e9s.
rest.error.delete.unauthorized=L'application cliente n'est pas autoris\u00e9e \u00e0 demander la suppression d'une identit\u00e9.
rest.error.export.unauthorized=L'application cliente n'est pas autoris\u00e9e \u00e0 exporter des identit\u00e9s.
rest.error.no.potential.duplicate.found=Aucun doublon potentiel trouv\u00e9.
rest.error.no.duplicate.rule.code.sent=Aucun code de r\u00e8gle de d\u00e9tection de doublon n'a \u00e9t\u00e9 envoy\u00e9.
rest.error.no.attribute.sent=Aucun attribut n'a \u00e9t\u00e9 envoy\u00e9.
rest.error.unknown.duplicate.rule.code=Code de r\u00e8gle de d\u00e9tection de doublon inconnu.
rest.error.inactive.duplicate.rule=R\u00e8gle de d\u00e9tection de doublon inactive.
rest.error.unknown.attribute.key=Cl\u00e9 d'attribut inconnue.
rest.error.missing.mandatory.attributes=Tous les attributs obligatoires doivent \u00eatre renseign\u00e9s.
rest.error.no.matching.identity=Aucune identit\u00e9 correspondante n'a \u00e9t\u00e9 trouv\u00e9e.
rest.error.update.conflict=Cette identit\u00e9 a \u00e9t\u00e9 mise \u00e0 jour r\u00e9cemment, merci de charger les derni\u00e8res donn\u00e9es avant de mettre \u00e0 jour.
rest.error.forbidden.update.on.merged.identity=Impossible de mettre \u00e0 jour une id\u00e9ntit\u00e9 rapproch\u00e9e. Le customerId de l'identit\u00e9 maîtresse est indiqu\u00e9 dans la r\u00e9ponse.
rest.error.forbidden.update.on.deleted.identity=Impossible de mettre \u00e0 jour une identit\u00e9 supprim\u00e9e.
rest.error.forbidden.mon.paris.active.update=L'application cliente n'est pas autoris\u00e9e \u00e0 mettre \u00e0 jour le marqueur 'mon_paris_active'.
rest.error.conflict.connection.id=Une identit\u00e9 existe d\u00e9j\u00e0 avec le connectionId renseign\u00e9. Le customerId de cette identit\u00e9 est indiqu\u00e9 dans la r\u00e9ponse.
rest.error.primary.identity.not.found=L'identit\u00e9 principale n'a pas pu \u00eatre trouv\u00e9e avec le customerId fourni.
rest.error.primary.identity.deleted=L'identit\u00e9 principale trouv\u00e9e avec le customerId fourni est supprim\u00e9e.
rest.error.primary.identity.merged=L'identit\u00e9 principale trouv\u00e9e avec le customerId fourni est rapproch\u00e9e.
rest.error.primary.identity.update.conflict=L'identit\u00e9 principale a \u00e9t\u00e9 mise \u00e0 jour r\u00e9cemment, merci de charger les derni\u00e8res donn\u00e9es.
rest.error.secondary.identity.not.found=L'identit\u00e9 secondaire n'a pas pu \u00eatre trouv\u00e9e avec le customerId fourni.
rest.error.secondary.identity.deleted=L'identit\u00e9 secondaire trouv\u00e9e avec le customerId fourni est supprim\u00e9e.
rest.error.secondary.identity.merged=L'identit\u00e9 secondaire trouv\u00e9e avec le customerId fourni est rapproch\u00e9e.
rest.error.secondary.identity.update.conflict=L'identit\u00e9 secondaire a \u00e9t\u00e9 mise \u00e0 jour r\u00e9cemment, merci de charger les derni\u00e8res donn\u00e9es.
rest.error.secondary.identity.not.merged=L'identit\u00e9 secondaire trouv\u00e9e avec le customerId fourni n'est pas rapproch\u00e9e.
rest.error.identities.not.merged.together=L'identit\u00e9 secondaire trouv\u00e9e avec le customerId secondaire fourni n'est pas rapproch\u00e9e avec l'identit\u00e9 principale trouv\u00e9e avec le customerId principal fourni.
rest.error.identity.not.found=Aucune identit\u00e9 n'a pu \u00eatre trouv\u00e9e avec le customerId fourni.
rest.error.identity.already.deleted=L'identit\u00e9 est d\u00e9j\u00e0 dans l'\u00e9tat supprim\u00e9.
rest.error.forbidden.delete.on.merged.identity=Une identit\u00e9 rapproch\u00e9e ne peut pas \u00eatre supprim\u00e9e.
rest.error.application.not.found=Aucune application n'a pu \u00eatre trouv\u00e9e avec le code fourni.
rest.error.service.contract.not.found=Aucun contrat de service n'a pu \u00eatre trouv\u00e9 avec le code fourni.
rest.error.unauthorized.operation=Op\u00e9ration non autoris\u00e9e.
rest.error.no.history.found=Aucun historique n'a \u00e9t\u00e9 trouv\u00e9 pour l'identit\u00e9 fournie.
rest.error.no.duplicate.rule.found=Aucune r\u00e8gle de d\u00e9tection de doublon n'a \u00e9t\u00e9 trouv\u00e9e.
rest.error.no.certification.level.found=Aucun niveau de certification n'a \u00e9t\u00e9 trouv\u00e9.
rest.error.no.attribute.key.found=Aucune cl\u00e9 d'attribut n'a \u00e9t\u00e9e trouv\u00e9e.
rest.error.no.certification.processus.found=Aucun processus de certification n'a \u00e9t\u00e9 trouv\u00e9.
rest.error.no.updated.identity.found=Aucune identit\u00e9 mise \u00e0 jour n'a \u00e9t\u00e9 trouv\u00e9e.
rest.error.already.excluded=Les identit\u00e9s ont d\u00e9j\u00e0 \u00e9t\u00e9 exclues des suspicions de doublon.
rest.error.not.excluded=Les identit\u00e9s ne sont pas exlues des suspicious de doublon.
rest.error.identity.already.suspicious=Cette identit\u00e9 a d\u00e9j\u00e0 \u00e9t\u00e9 signal\u00e9e comme suspecte.
rest.error.no.suspicious.identity.found=Aucune identit\u00e9 suspecte n'a \u00e9t\u00e9 trouv\u00e9e.
rest.error.must.provide.client.code.or.token=Vous devez indiquer un client_code ou un client_token.
rest.error.connected.identity.restricted.attribute.update=L'identit\u00e9 est connect\u00e9e, la mise \u00e0 jour des attributs est restreinte.
rest.error.connected.identity.forbidden.self.declare=L'identit\u00e9 est connect\u00e9e, l'ajout d'attributs avec un niveau de certification auto-d\u00e9claratif n'est pas autoris\u00e9.
rest.error.connected.identity.forbidden.update.lesser.certification=L'identit\u00e9 est connect\u00e9e, la mise \u00e0 jour des attributs avec un niveau de certification inf\u00e9rieur n'est pas autoris\u00e9e.
rest.error.connected.identity.forbidden.pivot.certification.under.threshold=L'identit\u00e9 est connect\u00e9e, et au moins un attribut 'pivot' est, ou a \u00e9t\u00e9 demand\u00e9 d'\u00eatre, certifi\u00e9 au dessus du seuil d\u00e9fini. Dans ce cas, tous les attributs 'pivot' doivent \u00eatre renseign\u00e9s, et certifi\u00e9s avec un niveau supp\u00e9rieur ou \u00e9gal au seuil d\u00e9fini.
rest.error.identity.all.pivot.attribute.same.certification=Tous les attributs 'pivot' doivent \u00eatre renseign\u00e9s et certifi\u00e9s avec le m\u00eame processus de certification.
rest.error.identity.forbidden.pivot.attribute.deletion=La suppression des attributs 'pivot' n'est pas autoris\u00e9e pour cette identit\u00e9.
rest.error.export.limit.exceeded=La liste de CUID fournie d\u00e9passe la limite autoris\u00e9e pour les exports.
rest.error.request.bad.format=La requ\u00eate envoy\u00e9e n'est pas correctement formatt\u00e9e
rest.error.client.authorization=Le client ne poss\u00e8de pas les autorisations n\u00e9cessaires pour effectuer cette requ\u00eate
rest.error.request.content.bad.format=Le contenu de la requ\u00eate envoy\u00e9e n'est pas correctement formatt\u00e9
rest.error.duplicates.consistency=La requ\u00eate envoy\u00e9e va \u00e0 l'encontre des r\u00e8gles de coh\u00e9rence des doublons
rest.error.resource.not.found=La ressource demand\u00e9e n'a pas \u00e9t\u00e9 trouv\u00e9e
rest.error.client.authorization.search=Le client ne poss\u00e8de pas l'autorisation n\u00e9cessaire pour effectuer une recherche
rest.error.search.identity.connection.id.or.criterias=Vous ne pouvez pas sp\u00e9cifier un connection_id et des crit\u00e8res de recherche en m\u00eame temps
rest.error.missing.customer.id=Le customer_id est manquant
rest.error.missing.author.name.and.type.headers=author_name et author_type doivent \u00eatre sp\u00e9cifi\u00e9s dans les headers de la requ\u00eate
rest.error.invalid.author.type=La valeur du author_type est invalide
rest.error.missing.client.code=Le client_code est manquant
rest.error.empty.search.criterias=Les crit\u00e8res de recherche envoy\u00e9s sont null ou vides
rest.error.empty.search.criterias.attributes=Les valeurs d'attributs pour la recherche d'identit\u00e9s sont null ou vides
rest.error.empty.change.criterias=Les crit\u00e8res de cr\u00e9ation/modification envoy\u00e9s sont null ou vides
rest.error.empty.identity.last.update.date=La date de derni\u00e8re mise \u00e0 jour de l'identit\u00e9 doit \u00eatre sp\u00e9cifi\u00e9e
rest.error.identity.attribute.missing.key=Les attributs fournis doivent sp\u00e9cifier leurs cl\u00e9s
rest.error.identity.attribute.not.certified=Les attributs fournis doivent \u00eatre certifi\u00e9s (processus + date)
rest.error.identity.attribute.missing.value=Les attributs fournis doivent sp\u00e9cifier une valeur
rest.error.identity.attribute.empty.value.for.create=Vous ne pouvez pas sp\u00e9cifier des valeurs d'attributs vides pour cr\u00e9er une identit\u00e9
rest.error.client.authorization.create=Le client ne poss\u00e8de pas l'autorisation n\u00e9cessaire pour effectuer une cr\u00e9ation
rest.error.client.authorization.update=Le client ne poss\u00e8de pas l'autorisation n\u00e9cessaire pour effectuer une mise \u00e0 jour
rest.error.client.and.app.code.not.matching=Le code client et le code application fournis ne correspondent pas
rest.error.identity.create.with.cuid=Vous ne pouvez pas sp\u00e9cifier un CUID lors d'une requ\u00eate de cr\u00e9ation
rest.error.identity.create.with.guid=Vous ne pouvez pas sp\u00e9cifier un GUID lors d'une requ\u00eate de cr\u00e9ation
rest.error.identity.create.with.mon.paris.flag=Vous ne pouvez pas sp\u00e9cifier le tag "mon_paris_active" lors d'une requ\u00eate de cr\u00e9ation
rest.error.identity.create.guid.already.exists=Ce GUID est d\u00e9j\u00e0 utilis\u00e9
rest.error.duplicate.search=Erreur lors de la recherche de doublons
rest.error.identity.update.with.only.connection.id=Vous ne pouvez pas mettre \u00e0 jour une identit\u00e9 en fournissant son connection_id. Vous devez sp\u00e9cifier un customer_id
rest.error.multiple.active.service.contracts=Il y a plus d'un contrat de service actif pour le code client fourni. Il doit y en avoir qu'un seul
rest.error.client.authorization.update.guid=Le client ne poss\u00e8de pas l'autorisation n\u00e9cessaire pour effectuer une mise \u00e0 jour du connection_id
rest.error.merge.request.null=La requ\u00eate de rapprochement fournie est null
rest.error.merge.request.no.primary.cuid=Une requ\u00eate de rapprochement d'identit\u00e9 doit fournir le CUID de l'identit\u00e9 principale
rest.error.merge.request.no.secondary.cuid=Une requ\u00eate de rapprochement d'identit\u00e9 doit fournir le CUID de l'identit\u00e9 secondaire
rest.error.merge.request.no.primary.last.update.date=Une requ\u00eate de rapprochement d'identit\u00e9 doit fournir la date de derni\u00e8re mise \u00e0 jour de l'identit\u00e9 principale
rest.error.merge.request.no.secondary.last.update.date=Une requ\u00eate de rapprochement d'identit\u00e9 doit fournir la date de derni\u00e8re mise \u00e0 jour de l'identit\u00e9 secondaire
rest.error.merge.request.no.attribute=Une requ\u00eate de rapprochement d'identit\u00e9 fournissant une identit\u00e9 doit inclure au moins un attribut
rest.error.cancel.merge.request.with.identity=Une requ\u00eate d'annulation de rapprochement ne peut pas fournir d'identit\u00e9. Seuls les CUIDs primaire et secondaire sont accept\u00e9s
rest.error.updated.identity.search.request.null.or.empty=La requ\u00eate de recherche d'identit\u00e9s mises \u00e0 jour est null ou vide
rest.error.export.request.null.or.empty=La requ\u00eate fournie est null ou contient une liste de CUID vide
rest.error.missing.target.client.code=target_client_code est manquant
rest.error.missing.service.contract.id=service_contract_id est manquant
rest.error.provided.service.contract.null=Le contrat de service fourni est null
rest.error.service.contract.without.client.code=Le contrat de service fourni doit sp\u00e9cifier un code client cible
rest.error.service.contract.without.start.date=Le contrat de service fourni doit sp\u00e9cifier une date de d\u00e9but
rest.error.service.contract.without.end.date=Le contrat de service fourni doit sp\u00e9cifier une date de fin
rest.error.service.contract.mandatory.attributes.minimum.certification=Les attributs obligatoires fournis doivent sp\u00e9cifier un niveau de certification minimum
rest.error.service.contract.start.date.conflict=La date de d\u00e9but du contrat de service est dans la plage de date d'un contrat de service existant
rest.error.service.contract.end.date.conflict=La date de fin du contrat de service est dans la plage de date d'un contrat de service existant
rest.error.neverending.service.contract.existing=Un contrat de service existe avec une date de fin infinie
rest.error.service.contract.insuficient.processus.level=Au moins un processus ne peut pas \u00eatre utilis\u00e9 dans la d\u00e9finition d'attribut car son niveau est insuffisant conform\u00e9ment au niveau de certification minimum exig\u00e9
rest.error.history.search.empty=La requ\u00eate de recherche d'historique d'identit\u00e9 envoy\u00e9e est null ou vide
rest.error.history.search.invalid=La requ\u00eate de recherche d'historique d'identit\u00e9 envoy\u00e9e est invalide : il est interdit de fournir 'nb_days_from' ainsi qu'un interval de dates dans la m\u00eame requ\u00eate
rest.error.missing.application.code=application_code est manquant
rest.error.client.application.null=L'application cliente fournie est null
rest.error.client.application.without.client.code=L'application cliente fournie doit sp\u00e9cifier un code client
rest.error.change.request.same.attribute.different.value=Vous ne pouvez pas fournir le m\u00eame attribut plusieurs fois avec des valeurs diff\u00e9rentes
rest.error.suspicious.search.request.null=La requ\u00eate de recherche d'identit\u00e9s suspectes fournie est null
rest.error.suspicious.change.request.null.or.empty=La requ\u00eate de modification d'identit\u00e9s suspectes fournie est null ou vide
rest.error.suspicious.exclude.request.null.or.empty=La requ\u00eate d'exclusion d'identit\u00e9s suspectes fournie est null ou vide
rest.error.missing.first.cuid=Le param\u00e8tre identity_cuid_1 est manquant
rest.error.missing.second.cuid=Le param\u00e8tre identity_cuid_2 est manquant
rest.error.missing.rule.code=Le param\u00e8tre rule code est manquant
rest.error.duplicate.search.request.null=La requ\u00eate de recherche de doublons fournie est null
rest.error.suspicious.lock.request.null.or.empty=La requ\u00eate de v\u00e9rouillage d'identit\u00e9s suspectes fournie est null ou vide
rest.error.service.contract.without.mandatory.fields=Le ServiceContractDto fourni doit sp\u00e9cifier ces champs : clientCode, startingDate, name, moaEntityName, moaContactName, moeResponsibleName, moeEntityName, serviceType
rest.error.end.date.before.start.date=La date de fin ne peut pas \u00eatre avant la date de d\u00e9but du contrat de service

# Info
rest.info.potential.duplicate.found=Potentiel(s) doublon(s) trouv\u00e9(s).
rest.info.successful.operation=Op\u00e9ration r\u00e9alis\u00e9e avec succ\u00e8s.
rest.info.no.attribute.change=Aucun attribut n'a \u00e9t\u00e9 mis \u00e0 jour car aucune modification n'\u00e9tait applicable.

#####################
## Attribute statuses
#####################

attribute.status.not.created=Cet attribut n'a pas \u00e9t\u00e9 cr\u00e9\u00e9 car la valeur fournie est invalide.
attribute.status.created=Cet attribut a \u00e9t\u00e9 correctement cr\u00e9\u00e9.
attribute.status.not.updated=Cet attribut existe d\u00e9j\u00e0 avec la m\u00eame valeur et le m\u00eame certificat.
attribute.status.updated=Cet attribut a \u00e9t\u00e9 correctement mis \u00e0 jour.
attribute.status.not.removed=Cet attribut est obligatoire et ne peut pas \u00eatre supprim\u00e9.
attribute.status.removed=Cet attribut a \u00e9t\u00e9 correctement supprim\u00e9.
attribute.status.uncertified=Cet attribut a \u00e9t\u00e9 correctement d\u00e9certifi\u00e9.
attribute.status.formatted.value=La valeur de cet attribut a \u00e9t\u00e9 formatt\u00e9e avant traitement.
attribute.status.insufficient.certification.level=Cet attribut ne peut pas \u00eatre mis \u00e0 jour car le certificat existant est d'un niveau supp\u00e9rieur \u00e0 celui du certificat fourni dans la requ\u00eate.

# Attribute validation

attribute.status.validation.error.only.alphanum.apostrophe.space.dash=Valeur invalide. Seuls les carract\u00e8res alphanum\u00e9riques, apostrophe, espace et tiret sont autoris\u00e9s.
attribute.status.validation.error.only.alpha.apostrophe.space.dash=Valeur invalide. Seuls les carract\u00e8res alphas, apostrophe, espace et tiret sont autoris\u00e9s.
attribute.status.validation.error.date.format=Valeur invalide. Les dates doivent \u00eatre \u00e9crites sur 10 carract\u00e8res, au format 'jj/mm/aaaa'.
attribute.status.validation.error.mobile.phone.format=Valeur invalide. Seuls les carract\u00e8res num\u00e9riques sont autoris\u00e9s. Cela doit repr\u00e9senter un num\u00e9ro français sur 10 chiffres, d\u00e9butant par O6 ou 07.
attribute.status.validation.error.fixed.phone.format=Valeur invalide. Invalid value. Seuls les carract\u00e8res num\u00e9riques sont autoris\u00e9s. Cela doit repr\u00e9senter un num\u00e9ro français sur 10 chiffres, d\u00e9butant par 01 \u00e0 05, ou 09.
attribute.status.validation.error.email.format=Valeur invalide. L'email doit \u00eatre \u00e9crit suivant le format 'xxx@yyy.zzz'.
attribute.status.validation.error.geocodes.format=Valeur invalide. Seuls les carract\u00e8res alphanum\u00e9riques sont autoris\u00e9s. Le code doit exister dans le r\u00e9f\u00e9rentiel Geocodes.
attribute.status.validation.error.only.uppercase.space=Valeur invalide. Seuls les carract\u00e8res alphas en majuscules non accentu\u00e9s et espace sont autoris\u00e9s.
attribute.status.validation.error.gender.format=Valeur invalide. Seuls les carract\u00e8res 0, 1 ou 2 sont autoris\u00e9s.

# Geocode validation

attribute.status.validation.error.unknown.geocodes.code=Le code fourni est inconnu du r\u00e9f\u00e9rentiel Geocodes.
attribute.status.validation.error.unknown.geocodes.label=Le label fourni est inconnu du r\u00e9f\u00e9rentiel Geocodes.
attribute.status.validation.error.geocodes.label.multiple.results=Le label fourni correspond \u00e0 plusieurs r\u00e9sultats dans le r\u00e9f\u00e9rentiel Geocodes. Merci de pr\u00e9ciser en fournissant le code.
attribute.status.geocodes.label.overridden=Le label fourni ne correspond pas au code fourni, et a \u00e9t\u00e9 remplac\u00e9 par le label Geocodes correct.
